### Step 1: Importing Libraries
We begin by importing `pandas` for data manipulation and `matplotlib` for visualization.

In [4]:
# Import the necessary libraries
import pandas as pd
import matplotlib.pyplot as plt

### Step 2: Load datasets
We load the data sets and display the first rows to understand the structure of each of the files.

In [2]:
# Load the datasets
cab_data = pd.read_csv('Cab_Data.csv')
city_data = pd.read_csv('City.csv')
customer_data = pd.read_csv('Customer_ID.csv')
transaction_data = pd.read_csv('Transaction_ID.csv')

# Display the first few rows of each dataset
cab_data.head(), city_data.head(), customer_data.head(), transaction_data.head()

(   Transaction ID  Date of Travel   Company        City  KM Travelled  \
 0        10000011           42377  Pink Cab  ATLANTA GA         30.45
 1        10000012           42375  Pink Cab  ATLANTA GA         28.62
 2        10000013           42371  Pink Cab  ATLANTA GA          9.04
 3        10000014           42376  Pink Cab  ATLANTA GA         33.17
 4        10000015           42372  Pink Cab  ATLANTA GA          8.73

    Price Charged  Cost of Trip
 0         370.95       313.635
 1         358.52       334.854
 2         125.20        97.632
 3         377.40       351.602
 4         114.62        97.776  ,
              City   Population      Users
 0     NEW YORK NY   8,405,837    302,149
 1      CHICAGO IL   1,955,130    164,468
 2  LOS ANGELES CA   1,595,037    144,132
 3        MIAMI FL   1,339,155     17,675
 4  SILICON VALLEY   1,177,609     27,247 ,
    Customer ID Gender  Age  Income (USD/Month)
 0        29290   Male   28               10813
 1        27703   Male   27                9237
 2        28712   Male   53               11242
 3        28020   Male   23               23327
 4        27182   Male   33                8536,
    Transaction ID  Customer ID Payment_Mode
 0        10000011        29290         Card
 1        10000012        27703         Card
 2        10000013        28712         Cash
 3        10000014        28020         Cash
 4        10000015        27182         Card)

### Step 3: Understand Field Names and Data Types
We use the `info()` method to display:
- The column names.
- Data types of each column.
- Number of non-null entries in each column.

This will help us understand if any field transformations are needed (e.g., converting data types) and if there are missing values to address.

In [7]:
# Get information about the datasets (column names and data types)
cab_data.info()
city_data.info()
customer_data.info()
transaction_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  int64
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(2), object(2)
memory usage: 19.2+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     object
 2   Users       20 non-null     object
dtypes: object(3)
memory usage: 608.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49171 entries, 0 to 49170
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         49171 non-null  int64
 1   Gender              49171 non-null  object
 2   Age                 49171 non-null  int64
 3   Income (USD/Month)  49171 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440098 entries, 0 to 440097
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  440098 non-null  int64
 1   Customer ID     440098 non-null  int64
 2   Payment_Mode    440098 non-null  object
dtypes: int64(2), object(1)
memory usage: 10.1+ MB

### Quality Check for Cab_Data.csv
We perform the following data quality checks:
1. **Duplicates**: We check if there are any duplicate rows in `Cab_Data.csv` and remove them if found.
2. **Missing Values**: We check for missing values in each column.

In [20]:
# Check for duplicates in Cab_Data.csv
cab_duplicates = cab_data.duplicated().sum()
print(f"Number of duplicate rows in Cab_Data.csv: {cab_duplicates}")

# Remove duplicates if any
cab_data = cab_data.drop_duplicates()

# Check for missing values in Cab_Data.csv
cab_missing = cab_data.isnull().sum()
print("Missing values in Cab_Data.csv:")
print(cab_missing)

# Check for duplicates in City.csv
city_duplicates = city_data.duplicated().sum()
print(f"Number of duplicate rows in City.csv: {city_duplicates}")

# Remove duplicates if any
city_data = city_data.drop_duplicates()

# Check for missing values in City.csv
city_missing = city_data.isnull().sum()
print("Missing values in City.csv:")
print(city_missing)

# Check for duplicates in Customer_ID.csv
customer_duplicates = customer_data.duplicated().sum()
print(f"Number of duplicate rows in Customer_ID.csv: {customer_duplicates}")

# Remove duplicates if any
customer_data = customer_data.drop_duplicates()

# Check for missing values in Customer_ID.csv
customer_missing = customer_data.isnull().sum()
print("Missing values in Customer_ID.csv:")
print(customer_missing)

# Check for duplicates in Transaction_ID.csv
transaction_duplicates = transaction_data.duplicated().sum()
print(f"Number of duplicate rows in Transaction_ID.csv: {transaction_duplicates}")

# Remove duplicates if any
transaction_data = transaction_data.drop_duplicates()

# Check for missing values in Transaction_ID.csv
transaction_missing = transaction_data.isnull().sum()
print("Missing values in Transaction_ID.csv:")
print(transaction_missing)

The history saving thread hit an unexpected error (OperationalError('attempt to write a readonly database')).History will not be written to the database.
Number of duplicate rows in Cab_Data.csv: 0
Missing values in Cab_Data.csv:
Transaction ID    0
Date of Travel    0
Company           0
City              0
KM Travelled      0
Price Charged     0
Cost of Trip      0
dtype: int64
Number of duplicate rows in City.csv: 0
Missing values in City.csv:
City          0
Population    0
Users         0
dtype: int64
Number of duplicate rows in Customer_ID.csv: 0
Missing values in Customer_ID.csv:
Customer ID           0
Gender                0
Age                   0
Income (USD/Month)    0
dtype: int64
Number of duplicate rows in Transaction_ID.csv: 0
Missing values in Transaction_ID.csv:
Transaction ID    0
Customer ID       0
Payment_Mode      0
dtype: int64


- The key relationships between the files are:
  - `Cab_Data.csv` and `Transaction_ID.csv` can be linked using the `Transaction ID` column.
  - `Transaction_ID.csv` and `Customer_ID.csv` can be linked using the `Customer ID` column.
  - `Cab_Data.csv` and `City.csv` can be linked using the `City` column.

We will preview these columns to ensure they are compatible for joining.

In [11]:
# Preview key columns that can be used for joining
cab_data[['Transaction ID', 'City', 'Company']].head()
transaction_data[['Transaction ID', 'Customer ID', 'Payment_Mode']].head()
customer_data[['Customer ID', 'Gender', 'Age', 'Income (USD/Month)']].head()
city_data[['City', 'Population', 'Users']].head()

# warning: notebook is only displaying the last one

             City   Population      Users
0     NEW YORK NY   8,405,837    302,149
1      CHICAGO IL   1,955,130    164,468
2  LOS ANGELES CA   1,595,037    144,132
3        MIAMI FL   1,339,155     17,675
4  SILICON VALLEY   1,177,609     27,247

### Step 4: Field/Feature Transformations
We convert the `Population` and `Users` columns in the `City.csv` file from strings to numeric values by removing commas and coercing any errors to NaN. This ensures we can perform mathematical operations on these fields later in the analysis.

In [12]:
# Convert population and users columns to numeric in city_data
city_data['Population'] = pd.to_numeric(city_data['Population'].str.replace(',', ''), errors='coerce')
city_data['Users'] = pd.to_numeric(city_data['Users'].str.replace(',', ''), errors='coerce')

# Verify changes
city_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     int64
 2   Users       20 non-null     int64
dtypes: int64(2), object(1)
memory usage: 608.0+ bytes

### Step 5: Determine Which Files Should Be Joined vs. Appended
We will:
- **Join** `Cab_Data.csv` with `Transaction_ID.csv` on `Transaction ID` to include customer payment information.
- **Join** the result with `Customer_ID.csv` on `Customer ID` to include demographic information.
- **Join** the result with `City.csv` on `City` to add geographic information.

This will result in a master dataset that contains all the necessary fields for analysis.

In [13]:
# Merge cab_data with transaction_data on 'Transaction ID'
merged_data = pd.merge(cab_data, transaction_data, on='Transaction ID')

# Merge the result with customer_data on 'Customer ID'
merged_data = pd.merge(merged_data, customer_data, on='Customer ID')

# Merge the result with city_data on 'City'
master_data = pd.merge(merged_data, city_data, on='City')

# Check the final master dataset
master_data.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip,Customer ID,Payment_Mode,Gender,Age,Income (USD/Month),Population,Users
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.635,29290,Card,Male,28,10813,814885,24701
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.854,27703,Card,Male,27,9237,814885,24701
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.632,28712,Cash,Male,53,11242,814885,24701
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.602,28020,Cash,Male,23,23327,814885,24701
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.776,27182,Card,Male,33,8536,814885,24701

### Step 6: Create Master Data and Explain the Relationship
We have created a master dataset that includes:
- Transaction details (from `Cab_Data.csv`).
- Payment information (from `Transaction_ID.csv`).
- Customer demographics (from `Customer_ID.csv`).
- Geographic data (from `City.csv`).

This master dataset is ready for further analysis.

In [14]:
# Display the master dataset's structure
master_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 14 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   Transaction ID      359392 non-null  int64
 1   Date of Travel      359392 non-null  int64
 2   Company             359392 non-null  object
 3   City                359392 non-null  object
 4   KM Travelled        359392 non-null  float64
 5   Price Charged       359392 non-null  float64
 6   Cost of Trip        359392 non-null  float64
 7   Customer ID         359392 non-null  int64
 8   Payment_Mode        359392 non-null  object
 9   Gender              359392 non-null  object
 10  Age                 359392 non-null  int64
 11  Income (USD/Month)  359392 non-null  int64
 12  Population          359392 non-null  int64
 13  Users               359392 non-null  int64
dtypes: float64(3), int64(7), object(4)
memory usage: 38.4+ MB

### Step 7: Perform Other Analysis: Outliers
We:
- Check for missing values in the master dataset to determine if any fields need imputation or cleaning.
- Use `describe()` to identify potential outliers in the numeric columns (such as extreme values in price or distance traveled).

In [19]:
# Check for missing values
print(master_data.isnull().sum())

# Describe the numerical columns to check for outliers
master_data.describe()

Transaction ID        0
Date of Travel        0
Company               0
City                  0
KM Travelled          0
Price Charged         0
Cost of Trip          0
Customer ID           0
Payment_Mode          0
Gender                0
Age                   0
Income (USD/Month)    0
Population            0
Users                 0
dtype: int64

,Transaction ID,Date of Travel,KM Travelled,Price Charged,Cost of Trip,Customer ID,Age,Income (USD/Month),Population,Users
count,3.593920e+05,359392.000000,359392.000000,359392.000000,359392.000000,359392.000000,359392.000000,359392.000000,3.593920e+05,359392.000000
mean,1.022076e+07,42964.067998,22.567254,423.443311,286.190113,19191.652115,35.336705,15048.822937,3.132198e+06,158365.582267
std,1.268058e+05,307.467197,12.233526,274.378911,157.993661,21012.412463,12.594234,7969.409482,3.315194e+06,100850.051020
min,1.000001e+07,42371.000000,1.900000,15.600000,19.000000,1.000000,18.000000,2000.000000,2.489680e+05,3643.000000
25%,1.011081e+07,42697.000000,12.000000,206.437500,151.200000,2705.000000,25.000000,8424.000000,6.712380e+05,80021.000000
50%,1.022104e+07,42988.000000,22.440000,386.360000,282.480000,7459.000000,33.000000,14685.000000,1.595037e+06,144132.000000
75%,1.033094e+07,43232.000000,32.960000,583.660000,413.683200,36078.000000,42.000000,21035.000000,8.405837e+06,302149.000000
max,1.044011e+07,43465.000000,48.000000,2048.030000,691.200000,60000.000000,65.000000,35000.000000,8.405837e+06,302149.000000

The previous table is slightly nonsensical for many of the variables, like: transaction ID, date of travel and customer ID. Also, the date appears in serial number format. So we will change that.

In [21]:
# Convert 'Date of Travel' from serial number to date format
cab_data['Date of Travel'] = pd.to_datetime(cab_data['Date of Travel'], origin='1899-12-30', unit='D')

# Display the first few rows to verify the change
cab_data[['Date of Travel']].head()

  Date of Travel
0     2016-01-08
1     2016-01-06
2     2016-01-02
3     2016-01-07
4     2016-01-03